---
kind: method
id: M:Autodesk.Revit.DB.TableSectionData.IsValidImageSymbolId(Autodesk.Revit.DB.ElementId)
source: html/e628f2ba-c925-31d2-de53-a541b14c6b95.htm
---
# Autodesk.Revit.DB.TableSectionData.IsValidImageSymbolId Method

Identifies if the element id represents a valid ImageSymbol element.

## Syntax (C#)
```csharp
public bool IsValidImageSymbolId(
	ElementId imageSymbolId
)
```

## Parameters
- **imageSymbolId** (`Autodesk.Revit.DB.ElementId`) - The element id of the image symbol.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null